[
  {
    "title": "LOVE CANNOT AFFORD TO BE BLIND",
    "img": "image-006.jpg",
    "categories": ["Kito Stories", "Our Stories"],
    "text": "His name is Taiwo Olakunle Balogun – his actual names. I want you to know that name, remember that name, because you will come to associate the devil with that name.\n\nI met him on Facebook in March last year. We got along very well, chatted every day, and when we exchanged numbers, we talked all the time. We had gotten past the hurdle of knowing that we were both gay, and it was obvious that we were into each other. We became such fast friends, that I even got to occasionally speak to his mother, his twin sister and his seven-year-old daughter on the phone. He wasn’t married or anything; simply had his daughter out of wedlock, and so, he and his baby mama chose to co-parent the girl.\n\nAt the time, I was staying with my elder sister in her apartment, but in May, I was all set to move into my own place. I told Taiwo about this, and he asked if he could come stay with me for a while because he’d lost his job due to the COVID lockdown and needed to leave Ogun State, where his family house was, and come to Lagos to look for another job. Even though I’d known him for about two months at this time, I declined this request. For a few days, he was on my case, begging me to reconsider. Eventually, I acquiesced and agreed for him to come live with me.\n\nThis was my first mistake.\n\nHe came over to my place, and that first night we spent together, he asked me to be his boyfriend. I liked him very much and we were going to be living together. So, it was very easy to say yes.\n\nHis job hunting took a week before he got lucky – which was a relief for me, because the burden was on me to cater for the welfare of the two of us. It wasn’t as though I was stressed by that responsibility; I was well-off financially, had a good job and I didn’t mind. I just didn’t want to start off a relationship with a boyfriend who’d be mooching off me.\n\nHe got a job as an automobile engineer, and it paid him 60 thousand naira monthly. This was when the honeymoon phase of our relationship officially ended and the troubles started.\n\nOne of the reasons Taiwo gave for why he had to stay with me in Lagos was that he didn’t know anyone in the Island. He told me he didn’t know anyone. However, it wasn’t very long before he suddenly had brothers who started dropping in on the regular. They were four guys – one of them always had his girlfriend with him – and anytime they visited, they’d leave with my things, like my shoes or clothes. I fought with Taiwo over this; it was bad enough that I had to share my clothes with him because we were the same size; I now had to share my things with his so-called brothers?! He would protest that they simply borrowed my stuff and would return whatever they took, but that didn’t make it any better.\n.\n.\n.",
    "author": "Ryan",
    "date": "17-06-2021",
    "likes": 695,
    "comments": 67
  },

  {
    "title": "Dear KD: Am I Queering Wrong?",
    "img": "image-007.jpg",
    "categories": ["Dear KD"],
    "text": "So, I don’t know how I went from reading about Timothée Chalamet to landing on Kito Diaries, but I’m glad I did. The stories here are funny and sad and enlightening at best.\n\nI am part of the community, asexual to be exact, and it was refreshing to see a collection of queer Nigerian stories.\n\nThe reason it is refreshing is because there seems to be a whole world of sex and excitement and hookups for queers in Nigeria, whether closeted or not.\n\nThat is, except me.\n\nI think maybe my life is dull because I am introverted and don’t make friends easily, but come on. Even people with the nastiest attitudes are getting laid and meeting people.\n\nAnd how do queer people know that others are queer? I thought about dating other girls at one point, but then the dilemma of finding out which girl would be interested was mind-bending. So I gave up.\n\nBut I did date a girl once before. We were in a regular lesbian relationship, but on account of me being ace, we didn’t have sex. She was manipulative and often suicidal, so I carried it in my head that I had to love her, that my love was what she needed to stop being sad. It didn’t work obviously, and she found another girl she liked. I found out (through much coercion) that she had slept in the same bed with this girl and touched her bra strap.\n\n“That’s all,” she told me. But by my standards, she basically had an affair. (Call me a prude if you want. I take intimacy very seriously)\n\nSo yeah, we broke up. I wasn’t really attracted to her or in love with her, but I loved her enough to comfort her when she was sad, which was all the time. And I liked that she liked me, which is horrible, I know.\n\nShe could still be sad now, but I try not to think about it. She was my first kiss (well, she kissed me while I was asleep, so she basically mouth-raped me, lol).\n\nSo yeah, reading stories about heartbreaks and dating on various sites like Kito Diaries makes me wonder why my life feels like nothing is happening. I am openly asexual and support LGBTQI rights, and so, I wonder why I’m not meeting other queer people. Is there something I should do about it? Because, it can feel pretty lonely, knowing that there could be other people in the community around me, whilst you I am over here, keeping up boring, faked conversations with straight people.\n\nI’m not even interested in sex, but I couldn’t get it if I wanted to. Either my gaydar is broken or hardly used, because it seems to not be working. I literally don’t know another queer person in real life. (Well except my ex, but I prefer to pretend she doesn’t exist). Besides her, not a single soul.\n\nSo, what is it? Am I getting this whole queer thing wrong?",
    "author": "Dandie",
    "date": "06-07-2021",
    "likes": 82,
    "comments": 5
  },

  {
    "title": "WHORE Of BABYLON (Episode 20)",
    "img": "image-008.jpg",
    "categories": ["Series (Fiction)"],
    "text": "Kenny is dragging his traveling box across the compound from its iron handle, walking ahead of us like he knows where he is going to. Jide has his other bag, a red-coloured tote bag made out of pure leather, and is trying very hard to appear as though he isn’t deliberately sticking to my side, but is failing very terribly at it.\n\nSuddenly Kenny stops and whirls around with a finger on his free hand pointing at me. “Don’t think you have gotten free, Sizi boo. But as it so happens, I can’t be sour for my husband. We’ll have that discussion later. Don’t get comfortable.”\n\nWith that, he continues ahead, then stops again almost immediately before turning to glare at Jide as if he’s only just realizing Jide is supposed to show him the way into the house.\n\nJide, as though grateful a decision has been made for him, walks away from my side, past Kenny and pushes open a door – and I kid you not – large enough to push another house through it.\n\nWe walk in and I hear a gasp. I don’t know if it came from me or from Kenny.\n\nMagnificent doesn’t just cut this interior. It is exquisite!\n\n“Amazing, isn’t it?” It’s Kenny. His voice is almost a whisper that is laced with apparent awe.\n\nI do not respond. I just nod mechanically as my mind is blown away by the sheer grandeur of the house.\n\nThe interior looks like something straight out of a catalogue about what a palace in ancient Rome looks like. The house appears to whisper cash, money, ego as I walk through the stadium of a living room to the great hall that is the dining room. I am taking my time, drinking in all this converted millions.\n\nI don’t know how long he has been watching, but Jide’s next words put an abrupt end to my wonder and pull up the emotions I am starting to forget exist. “You like the place, huh?”\n\nI throw him a middle-finger, stomp past him and plop down on one of the numerous settees in the living room. That is when I notice Kenny has disappeared.\n\nI do not want to ask – Lord knows I do not want to engage this boy – but this is a house I haven’t been to, a very large house that obviously belongs to a very influential person. And my friend is already missing.\n.\n.\n.",
    "author": "Delle",
    "date": "13-04-2020",
    "likes": 515,
    "comments": 5
  }
]
